{"id":79640,"date":"2021-11-02T10:24:07","date_gmt":"2021-11-02T02:24:07","guid":{"rendered":"https:\/\/www.bodhispa.com\/?p=79640"},"modified":"2021-11-10T13:43:30","modified_gmt":"2021-11-10T05:43:30","slug":"what-does-ingestible-collagen-do-for-your-skin","status":"publish","type":"post","link":"https:\/\/www.bodhispa.com\/what-does-ingestible-collagen-do-for-your-skin\/","title":{"rendered":"What does ingestible collagen do for your skin?"},"content":{"rendered":"<h3><a href=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\" wp-image-79667 alignright\" src=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-258x300.jpg\" alt=\"\" width=\"421\" height=\"490\" srcset=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-258x300.jpg 258w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-879x1024.jpg 879w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-768x894.jpg 768w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-1319x1536.jpg 1319w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-1x1.jpg 1w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-150x175.jpg 150w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423-300x349.jpg 300w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2021\/11\/NatalieMcGrathJOSOFounderwhitebackground1-scaled-e1635819259423.jpg 1465w\" sizes=\"(max-width: 421px) 100vw, 421px\" \/><\/a>We spoke to <strong>WA Naturopath<\/strong> and <strong>Founder of JOSO Natalie McGrath<\/strong>, about her scientifically proven, all-natural <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO Skin Health and Glow Formula<\/a>, and what it does for your skin, hair and nails &#8211; and your overall wellbeing!<\/h3>\n<h3>What is GLOWSO?<\/h3>\n<p><a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> is an anti-aging skin supplement to promote skin health and radiance &#8211; now available at BODHI Spas! It is 100% natural and scientifically proven to support collagen formation, firm skin and boost skin elasticity. It&#8217;s also packed full of antioxidants to reduce free radicals throughout the body.<\/p>\n<p>Collagen is the major structural component of skin, comprising about 80% of its dry weight. The natural Collagen Peptides in <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> stimulate skin metabolism which results in noticeably firmer and smoother skin, and fewer wrinkles. It improves skin surface structure, reducing cellulite and is amazing for boosting nail and hair growth too.<\/p>\n<p><a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> is approved by the TGA (Therapeutic Goods Association) here in Australia which means it&#8217;s classed as a therapeutic medicine, so is of the highest quality and safety, which is really important to me.<\/p>\n<h3>Why did you create GLOWSO?<\/h3>\n<p>Over the past few years the number one question I get asked from my female patients is &#8216;what can I do for the appearance and health of my skin&#8217;. There’s been a definite shift in peoples’ attitude towards beauty. I’m finding women are wearing less makeup and are wanting to avoid the toxic procedures that are on offer.<\/p>\n<p>There’s a desire to embrace wellness, boost vitality and for people to feel comfortable in their own skin. I went searching for ingestible products that I could recommend to my clients but I wasn’t happy with what I found. So I started creating my own. And that&#8217;s how <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> came about.<\/p>\n<h3>How long does GLOWSO take to work?<\/h3>\n<p>On average you&#8217;ll see great results in four weeks, but some people are even seeing results in two weeks. The ingredients in <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> are scientifically proven to increases collagen in the skin by 65% in four weeks, crows feet are reduced by 32%, and elastin in the skin is increased by 18% in that four week period.<\/p>\n<h3>What is the ideal dosage?<\/h3>\n<p>To get optimal results, take three tablets of <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO<\/a> a day. For lasting results its ideal to take this dose long term. There is a maintenance dose of 1 a day for people that have achieved their desired results, but it&#8217;s safe to continue on the three a day dose for those who want to.<\/p>\n<h3>How long did it take you to develop GLOWSO?<\/h3>\n<p>Longer than I expected! It took over two years of research, product development and formulation. I did this in collaboration with Western Sydney University and the NICM Health Institute to get GLOWSO TGA listed and backed by solid scientific evidence. Product safety and efficacy are very important to me.<\/p>\n<h3>What is your background?<\/h3>\n<p>I’ve been a naturopath for almost 20 years specialising in women’s health. Being a naturopath I have had the opportunity to positively impact women’s lives, and that really inspires me. When I can support women to feel better, have more energy and vitality, there is a flow on affect that influences their relationships, their families, their communities, and their purpose!<\/p>\n<h3>What are the key ingredients in GLOWSO and what do they do?<\/h3>\n<p>The key ingredients in GLOWSO are <strong>Kakadu Plum<\/strong>, naturally sourced <strong>Bioactive Collagen Peptides <\/strong>and <strong>Zeathanthin<\/strong> and<strong> Lutein<\/strong> &#8211; two powerful antioxidants extracted from the Marigold flower. It also contains Zinc, Vitamin E and Vitamin B7.<\/p>\n<p>Kakadu Plum is the world’s highest natural source of Vitamin C. Being in its natural form means it’s more bioactive and absorbs effectively in to the body&#8217;s cells, which is extremely beneficial for skin health and repair, and for collagen production. We source our Kakadu Plum from NAAKPA (Northern Australian Aboriginal Kakadu Plum Alliance). It is important to us at JOSO that we are supporting the ethical supply of Kakadu Plum.<\/p>\n<p>The Bioactive Collagen Peptides in GLOWSO stimulate skin metabolism. When these collagen peptides are ingested, you see noticeably firmer and smoother skin with fewer wrinkles. The positive effect of collagen peptides also shows in an improved skin surface structure, reducing cellulite and a faster nail growth with reportedly less chipping of fingernails.<\/p>\n<p>Powerful antioxidants Zeathanthin and Lutein, from the Marigold flower, work to reduce free radicals formed in the body to protect the whole being.<\/p>\n<h3>How does GLOWSO work as an internal suncreen?<\/h3>\n<p>Interestingly, antioxidants Lutein and Zeathanthin extracts of the Marigold flower have shown to give a level of protection for skin and eyes against UV and blue light exposure. The research is still being formulated but it’s believed that the powerful antioxidant effect reduces free radicals formed in the body and decreases free radical damage to cells to protect eyes and the skin.<\/p>\n<h3>As a Naturopath, what are your top 3 tips for wellbeing?<\/h3>\n<ol>\n<li><strong>Drink water.<\/strong> Such a simple thing to do but people really struggle with this. Dehydration is the number one cause for fatigue and dull lifeless skin.<\/li>\n<li><strong>Look after your gut health.<\/strong> The gut is the foundation for the rest of your health. The best way to do this is to support your microbiome by eating as many different plant foods as possible. The different plant foods have different fibres which feed different types of microbes in your gut. When you have abundant diversity and numbers of different species this has a flow on effect to great health, energy mood and vitality.<\/li>\n<li><strong>Move your body.<\/strong> Nothing increases energy and mood faster than exercise. It also reduces inflammation and stimulates the lymphatic system that clears toxins from the body.<\/li>\n<\/ol>\n<h3>What&#8217;s coming next for JOSO?<\/h3>\n<p>We have some exciting products in the pipeline, all harnessing the extraordinary powers of Australian botanicals. We&#8217;re working on a specific formula for detoxification that will be great for acne, as well as a formula based on supporting the gut-skin axis, with prebiotics and probiotics. Watch this space!<\/p>\n<h3><a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">GLOWSO Skin Health &amp; Glow Formula<\/a> is $49.50 and available at all BODHI Spas in Perth on online <a href=\"https:\/\/www.bodhispa.com\/product\/glowso-skin-health-glow-formula\/\">here<\/a> at bodhispa.com.<\/h3>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We spoke to WA Naturopath and Founder of JOSO Natalie McGrath, about her scientifically proven, all-natural GLOWSO Skin Health and Glow Formula, and what it does for your skin, hair and nails &#8211; and your overall wellbeing! What is GLOWSO? GLOWSO is an anti-aging skin supplement to promote skin health and radiance &#8211; now available&hellip;<\/p>\n","protected":false},"author":3,"featured_media":79668,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[55,57,56,54],"tags":[142,143,141],"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/79640"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/comments?post=79640"}],"version-history":[{"count":10,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/79640\/revisions"}],"predecessor-version":[{"id":79922,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/79640\/revisions\/79922"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/79668"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=79640"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/categories?post=79640"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/tags?post=79640"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}