{"id":80773,"date":"2021-11-30T14:45:19","date_gmt":"2021-11-30T06:45:19","guid":{"rendered":"https:\/\/www.bodhispa.com\/?p=80773"},"modified":"2021-12-07T14:15:48","modified_gmt":"2021-12-07T06:15:48","slug":"talking-planet-positive-skincare-with-emma-lewisham","status":"publish","type":"post","link":"https:\/\/www.bodhispa.com\/talking-planet-positive-skincare-with-emma-lewisham\/","title":{"rendered":"Talking planet positive skincare with Emma Lewisham"},"content":{"rendered":"<h3>We spoke to skincare Founder Emma Lewisham about her planet positive, all-natural range, and which of her products she recommends you should start with!<\/h3>\n<h3><strong>1. What is your background, and what inspired you to create your own natural skincare rage?<\/strong><\/h3>\n<p>Prior to founding EL I worked as one of the few female, senior executives in a global Japanese technology company in a role that encompassed business strategy, customer insight and research, marketing and sustainability.<\/p>\n<p>In 2016 I lost my mother to cancer and it made me question my own health and the way I was living.  I had been putting work over wellness for many years and so I began making a lot of lifestyle changes. Until this point, I hadn&#8217;t considered what I used on my skin, as something that needed changing.<\/p>\n<p>It wasn’t until I was pregnant, I was told to stop using a product called hydroquinone as it was ‘toxic’ and questionable for people’s health and it put me on a path to natural skincare.It wasn’t until I was pregnant, I was told to stop using a product called hydroquinone as it was ‘toxic’ and questionable for people’s health and it put me on a path to natural skincare.<\/p>\n<p>I was used to using high tech, luxury skincare, and when I went looking for the natural alternative with the same science, I couldn’t find it. There was a compromise that existed in natural skincare, so I set out to create my own.<\/p>\n<p>I founded Emma Lewisham to set a new benchmark in beauty, and having only been on the market for 19 months, I’m so proud of what we have been able to achieve from Aotearoa in New Zealand in this short time. I truly believe that we can thrive by giving more than we take and that we can profit from preventing problems, not creating them.<\/p>\n<h3><strong>2. Tell us about the Emma Lewisham circular approach to beauty?<\/strong><\/h3>\n<p>At Emma Lewisham, we offer refills for all our products. The Emma Lewisham Beauty Circle (ELBC) is our global take-back programme for refilling and recycling, to keep our packaging in circularity and reduce carbon emissions. When you purchase one of our refill pods or pouch, instead of a brand new product, you reduce your carbon emissions by up to 74%. For any refill pod or pouch that we cannot sterilise and reuse, we ensure it’s recycled through TerraCycle.<\/p>\n<p>Circularly designed packaging is important because single use packaging is the largest contributor to carbon emissions in the beauty industry. So, to reduce carbon emissions and eliminate the billions of units of packaging waste currently produced each year, we must move away from the linear ‘take-make-waste’ model of business and keep our packaging in use through implementing a circular model.<\/p>\n<p>Our products are built on a foundation of sustainability as I believe this is the only responsible way to do business. We are in a climate crisis and I believe that any product that is created in today’s world should be helping to build a better one. Profits, to me, are only rewarding if they don’t come at an expense to people or the planet.<\/p>\n<h3><strong>3. As a Planet Positive skincare brand, you are climate positive certified, what does this mean?<\/strong><\/h3>\n<p>Our carbon positive certification means that we take more carbon emissions out of the atmosphere than we put in &#8211; which creates a ‘positive’ environmental impact. This is also sometimes called ‘carbon negative’ or ‘climate positive’, however they all mean the same thing. <strong> <\/strong><\/p>\n<p>At Emma Lewisham, after reducing each product&#8217;s inherent carbon footprint as much as possible, we then offset our remaining carbon emissions by 125% through our partners Toitū Envirocare, to become certified under their Climate Positive programme.<\/p>\n<p>Packaging is the beauty industry&#8217;s single largest contributor of carbon emissions, so moving towards a circular, climate positive business model is the only viable solution to reducing waste, carbon emissions, and meeting global climate targets.<\/p>\n<h3><strong>4. What is your Emma Lewisham all-time hero product + why? <\/strong><\/h3>\n<p>Our all-time hero product has to be our <a href=\"https:\/\/www.bodhispa.com\/product\/skin-reset-serum\/\">Skin Reset Serum<\/a>. It has become a cult favourite for its results in evening skin tone, combating hyperpigmentation and restoring radiance. It’s unparalleled brightening technology has also been proven to outperform even the most recognised luxury brands on the market.<\/p>\n<h3><strong>5. What is the star ingredient in Emma Lewisham skincare? What does it do?<\/strong><\/h3>\n<p>Plant Stem Stells &#8211; in development for over five years by the Swiss Institute of Agriculture, this patented combination of alpine plant extracts actively improves the look of dark spots and pigmentation through inhibiting the enzyme responsible for producing melanin (tyrosinase).  This brightening action gradually enhances the skin’s radiance, resulting in a more luminous looking skin with an even tone.<\/p>\n<h3><strong>6. If someone is new to Emma Lewisham – what product would you recommend they start with?<\/strong><\/h3>\n<p>For the best results, I would recommend starting with three products as all our formulations are designed to work together. I would start with the <a href=\"https:\/\/www.bodhispa.com\/product\/illuminating-oil-cleanser\/\">Illuminating Oil Cleanser<\/a>, <a href=\"https:\/\/www.bodhispa.com\/product\/skin-reset-serum\/\">Skin Reset Serum<\/a> and <a href=\"https:\/\/www.bodhispa.com\/product\/supernatural-72-hour-creme\/\">Supernatural 72-Hour Crème<\/a>.<\/p>\n<p>Our <a href=\"https:\/\/www.bodhispa.com\/product\/illuminating-oil-cleanser\/\">Illuminating Oil Cleanser<\/a> is the perfect everyday cleanser packed full of antioxidants and nutrients for full spectrum cleansing and hydration. Our <a href=\"https:\/\/www.bodhispa.com\/product\/skin-reset-serum\/\">Skin Reset Serum<\/a> is a cult favourite for evening skin tone, combating hyperpigmentation and restoring radiance. And, our <a href=\"https:\/\/www.bodhispa.com\/product\/supernatural-72-hour-creme\/\">Supernatural 72-Hour Crème<\/a> deeply hydrates for a youthful glow while visibly reducing the appearance of fine lines and wrinkles.<\/p>\n<h3><strong>7. What’s the go-to Emma Lewisham product for redness and irritated skin?<\/strong><\/h3>\n<p>I would recommend trying our <a href=\"https:\/\/www.bodhispa.com\/product\/skin-reset-serum\/\">Skin Reset Serum<\/a>. This product has bioactives that help reduce redness while nourishing and restoring the skin.  Some of the actives working to maintain a healthy skin barrier which is very important if you have sensitive skin are:<\/p>\n<ul>\n<li><strong>Niacinamide:<\/strong> This antioxidant, helps reduce redness while promoting an overall healthy-looking complexion.<\/li>\n<li><strong>Vitamin rich Prickly Pear and Sea Buckthorn:<\/strong> This powerful antioxidant combination, rich in essential fatty acids for optimal skin integrity helps nourish and restores skin.<\/li>\n<li><strong>Sodium hyaluronate (Hyaluronic Acid):<\/strong> Derived from hyaluronic acid, sodium hyaluronate binds up to 1000 times its own weight in water, for longer lasting, more effective hydration to help balance a healthy skin barrier.  It also helps visibly improve the appearance of fine lines and wrinkles for smoother, plumper looking skin.<\/li>\n<\/ul>\n<p>Of course, we know that everyone’s skin is different. So we would absolutely recommend an initial patch test.<\/p>\n<h3><strong>8. What’s coming next for Emma Lewisham?<\/strong><\/h3>\n<p>Our next big goals are to halve our products’ inherent carbon footprints by 2023 and cut them to virtually zero by 2030. This is a big goal but one I am very excited to achieve. We are also currently working through our B-Corp Certification, which we hope to have by the end of 2021.  And, on a more immediate note, we have just launched some beautiful new products for the holiday season!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We spoke to skincare Founder Emma Lewisham about her planet positive, all-natural range, and which of her products she recommends you should start with! 1. What is your background, and what inspired you to create your own natural skincare rage? Prior to founding EL I worked as one of the few female, senior executives in&hellip;<\/p>\n","protected":false},"author":3,"featured_media":80779,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[55,57,56,1,54],"tags":[154,153,141],"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/80773"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/comments?post=80773"}],"version-history":[{"count":10,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/80773\/revisions"}],"predecessor-version":[{"id":81191,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/80773\/revisions\/81191"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/80779"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=80773"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/categories?post=80773"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/tags?post=80773"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}