{"id":85311,"date":"2022-02-16T11:53:02","date_gmt":"2022-02-16T03:53:02","guid":{"rendered":"https:\/\/www.bodhispa.com\/?p=85311"},"modified":"2022-02-16T12:12:06","modified_gmt":"2022-02-16T04:12:06","slug":"five-minutes-with-megan-larsen-sodashi-founder","status":"publish","type":"post","link":"https:\/\/www.bodhispa.com\/five-minutes-with-megan-larsen-sodashi-founder\/","title":{"rendered":"Five minutes with Megan Larsen, Sodashi Founder"},"content":{"rendered":"<h3>We spoke to Megan Larsen, Founder of Sodashi skincare, about the vibrational qualities of essential oils, keeping your Chakras in check and which BODHI Spa she likes to visit most.<\/h3>\n<p><a href=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-scaled.jpg\"><img decoding=\"async\" loading=\"lazy\" class=\" wp-image-85312 alignright\" src=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-231x300.jpg\" alt=\"\" width=\"290\" height=\"377\" srcset=\"https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-231x300.jpg 231w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-788x1024.jpg 788w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-768x999.jpg 768w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-1181x1536.jpg 1181w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-1575x2048.jpg 1575w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-1x1.jpg 1w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-150x195.jpg 150w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-300x390.jpg 300w, https:\/\/www.bodhispa.com\/wp-content\/uploads\/2022\/02\/meganlarsen-scaled.jpg 1969w\" sizes=\"(max-width: 290px) 100vw, 290px\" \/><\/a><\/p>\n<h3>What is your <a href=\"https:\/\/www.bodhispa.com\/brand\/sodashi\/?filtered=sodashi\">Sodashi<\/a> all-time hero product + why?<\/h3>\n<p>Sodashi Cell Renewal drops.  I love how when someone starts to use these drops for the first time their skin is completely transformed.  They keep the skin looking fresh, dewy and glowing – and really help with all those pesky skin challenges, like fine lines, dehydration, pigmentation…. an endless list of benefits.<\/p>\n<h3>What is the star ingredient in <a href=\"https:\/\/www.bodhispa.com\/brand\/sodashi\/?filtered=sodashi\">Sodashi<\/a> skincare? What does it do?<\/h3>\n<p>We have over 100 highly effective and consciously sourced natural ingredients.<\/p>\n<p>I’d say every ingredient in Sodashi products is a star!  But one of our superstar ingredients – Centella Asiatica, contains a bunch of biologically active components (terpenoids) which slow down the degradation of collagen – in fact Centella Asiatica stimulates collagen fibroplasts, which is necessary for maintaining the structure, firmness and elasticity of our skin.<\/p>\n<p>Another important fact &#8211; Sodashi uses ingredients rich in natural vitamins, so they are easy for the skin to absorb.<\/p>\n<h3>If someone is new to Sodashi – what three products would you recommend they start with?<\/h3>\n<p>Cleanse, Compress, Moisturise.<\/p>\n<p>The <a href=\"https:\/\/www.bodhispa.com\/product\/rejuvenating-clay-cleanser-with-lavender-150ml\/\">Sodashi Clay Cleanser<\/a> is a wonderful, creamy cleanser you apply to the skin with a small amount of water and when you remove it leaves your skin cleansed, but without any tight feeling.<\/p>\n<p>Follow your cleansing with the Sodashi Cell Renewal drops – they are what I refer to as a ‘skin gamechanger’, since they will positively reset your skin and the aromas are calming, balancing, and lifting for the mood.<\/p>\n<p>Finish with your recommended <a href=\"https:\/\/www.bodhispa.com\/product\/rejuvenating-face-and-neck-moisturiser-100ml\/\">Sodashi Moisturiser<\/a>, no matter whether you have oily or dry skin our moisturiser formulas will give you the exact amount of moisture your skin needs.<\/p>\n<h3>What’s the magic that happens in the Sodashi <a href=\"https:\/\/www.bodhispa.com\/product\/bodhi-chakra-balance\/\">Chakra Balance treatment<\/a>?<\/h3>\n<p>Chakras are main energy hubs in our body, which when they are balanced, they will support us mentally, physically, spiritually, and emotionally.<\/p>\n<p>This unique treatment is a combination of a deeply meditative experience with bodywork purposefully created to bring the chakras into alignment through a fluid combination of massage, specialised essential oil synergies and specific crystals.<\/p>\n<p>The <a href=\"https:\/\/www.bodhispa.com\/product\/bodhi-chakra-balance\/\">Chakra Balance treatment<\/a> works subtly on the energetic body, but with profound effect for your wellbeing, so you will feel calm, centred and in a delightful state of harmony after this incredible treatment.<\/p>\n<h3>What’s the go-to Sodashi product for redness and irritated skin?<\/h3>\n<p>The cooling and calming effect of the <a href=\"https:\/\/www.bodhispa.com\/product\/calming-skin-boost-50ml\/\">Sodashi Calming Skin Boost<\/a> will immediately calm and soothe red or irritated skin.<\/p>\n<p>I also use the <a href=\"https:\/\/www.bodhispa.com\/product\/calming-skin-boost-50ml\/\">Calming Skin Boost<\/a> on insect bites because it takes away the inflammation and the itchiness and I’m never left with any scarring or red marks.<\/p>\n<h3><strong>Essential oils are a key ingredient in Sodashi, which 3 are your favourites, and why? <\/strong><\/h3>\n<p><strong>Lavender<\/strong><\/p>\n<p>It is is powerfully healing and regenerating for the skin. I’ve seen Lavender renew skin that has been burnt badly, as well reduce scarring, and calm inflamed and irritated skins.<\/p>\n<p><strong>Geranium <\/strong><\/p>\n<p>It is such an effective skin balancer, balancing the skin’s natural oil secretion so it’s great for oily and dry skins, as well it boosts our skin’s health and natural glow.<\/p>\n<p><strong>Frankincense<\/strong><\/p>\n<p>It has cytophylactic properties (which means it protects the cells and helps generate new skin cells) – so it’s incredibly beneficial for skin dryness, reducing wrinkles and improving our skin tone.<\/p>\n<h3>Can you tell us about the vibrational qualities of essential oils, and what benefits they provide?<\/h3>\n<p>Essential oils are derived by distillation or extraction from pure plant source and are thought to have the highest vibrational frequencies of any organic substance on the planet!  Starting at 52MHz and through to a whopping 320 MHz (which is what Sodashi’s pure Damask Rose essential oil from Turkey resonates at).<\/p>\n<p>Essential oils entrain the cells of the body to increase their vibratory rate, and research has shown that they positively improve your mood and your physical health.<\/p>\n<h3>What new natural ingredients are you most excited about now? And what are its qualities?<\/h3>\n<p>We have a beautiful new product release coming up with some exciting new ingredients &#8211; one ingredient is highly prized in skin care, containing essential proteins for the skin and it’s also rich in vitamin C.  I can’t say too much yet, but I can say I have been trialling the product and now I can’t do without it!<\/p>\n<h3>What’s you biggest tip for beautiful skin in summer?<\/h3>\n<p>For summer, exfoliate regularly (at least twice a week) and moisturise twice a day.  Air conditioning, sun, swimming will dry and dehydrate the skin so it’s important to replenish moisture.<\/p>\n<p>Exfoliation and removing surface dead skin cells ensures you get the most from your moisturiser, because it can absorb in to the deeper layers of the skin and that’s when it will be the most effective.<\/p>\n<h3>What’s coming next for Sodashi?<\/h3>\n<p>We are continuing to do what we do best – creating transformational skincare, so we have an amazing year planned with exciting new product releases, and we also have a relaunch of some Sodashi favourites in beautiful new packaging.<\/p>\n<h3>Which BODHI spa do you usually visit when you are in Perth and why?<\/h3>\n<p>I believe the most relaxing spa experience should begin moment you arrive and not end until you leave the spa.<\/p>\n<p>At the <a href=\"https:\/\/www.bodhispa.com\/location\/highgate\/\">Bodhi Highgate Spa<\/a> I always have this feeling, a warm greeting, the sublime experience of being nurtured and nourished with my favourite Sodashi treatment, and the post spa experience, relaxing and enjoying the delicious Bodhi treat in the Bali inspired garden, or the relaxation room in winter.<\/p>\n<p>Shop <a href=\"https:\/\/www.bodhispa.com\/brand\/sodashi\/?filtered=sodashi\">Sodashi<\/a> at BODHI Spas and earn BODHI Rewards points for some extra self-care. Ask our team for details.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We spoke to Megan Larsen, Founder of Sodashi skincare, about the vibrational qualities of essential oils, keeping your Chakras in check and which BODHI Spa she likes to visit most. What is your Sodashi all-time hero product + why? Sodashi Cell Renewal drops.  I love how when someone starts to use these drops for the&hellip;<\/p>\n","protected":false},"author":3,"featured_media":50186,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/85311"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/comments?post=85311"}],"version-history":[{"count":8,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/85311\/revisions"}],"predecessor-version":[{"id":85320,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/posts\/85311\/revisions\/85320"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/50186"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=85311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/categories?post=85311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/tags?post=85311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}