{"id":45980,"date":"2021-02-25T02:52:11","date_gmt":"2021-02-25T02:52:11","guid":{"rendered":"https:\/\/wiry-tin.flywheelsites.com\/?page_id=45980"},"modified":"2022-07-16T12:36:15","modified_gmt":"2022-07-16T04:36:15","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.bodhispa.com\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"<h3>GENERAL BODHI SPA TERMS &amp; CONDITIONS<\/h3>\n<h3>Arrival Time<\/h3>\n<p>Please arrive 15 minutes prior to your treatment start time to allow time for you to change and unwind. Arriving late will reduce the treatment time, to ensure the next guest is not delayed. We invite you to make full use of our lounge facilities before and after your treatment.<\/p>\n<h3>Reservations<\/h3>\n<p>To ensure your preferred time and service is available we recommend booking in advance. Credit card details or gift voucher number are required at time of booking to secure your reservation.<\/p>\n<h3>Consultation<\/h3>\n<p>Before your treatment your therapist will complete a quick medical questionnaire with you and discuss your needs, likes and dislikes, noting any areas of stress or discomfort. They will then adapt the treatment to suit your personal requirements. Our goal is to completely nurture you. If at any time you feel uncomfortable, too hot or too cold, would prefer a lighter, or stronger treatment, please let the therapist know.<\/p>\n<h3>Public Holidays<\/h3>\n<p>Please note a 15% surcharge applies on all treatments on public holidays, gift voucher redemptions included. Discounts\/discount vouchers are not valid on these days.<\/p>\n<h3>Gift Vouchers<\/h3>\n<p>Vouchers are valid for 36 months from the date of purchase. Lost\/stolen vouchers cannot be reclaimed. To avoid disappointment, please note that to secure an appointment on a late evening or weekends\/public holidays a minimum four weeks advance notice is generally required. Please note prices\/treatments may vary between locations.<\/p>\n<h3>Cancellations<\/h3>\n<p>If you are unable to make your appointment, we kindly requests <strong>24 hours notice<\/strong> for all bookings scheduled Monday to Friday, and <strong>48 hours notice<\/strong> for all bookings scheduled on Saturdays, Sundays and Public Holidays to avoid full charges being applied to your cancelled treatment, including gift voucher bookings, which will then be deemed void.<\/p>\n<h3>Payments<\/h3>\n<p>Bodhi accepts cash, American Express, EFTPOS, Mastercard and VISA. We regret we do not accept Diners Club or personal cheques.<\/p>\n<h3>Security<\/h3>\n<p>We ask you to leave your valuables at home as we cannot take any responsibility for valuables left on the premises.<\/p>\n<h3>Spa Etiquette<\/h3>\n<p>To ensure the comfort and relaxation of all guests, we ask that you keep noise to a bare minimum at all times and respect that the spa is a mobile and smoke free environment. Though we love children, they are not permitted in the treatment rooms or spa lounge areas and their attendance is discouraged.<\/p>\n<h3>Parking<\/h3>\n<ul>\n<li><strong>Cottesloe spa: <\/strong>Free 2-hour parking on Station Street, and two 4-hour carparks on corner of Station Street and Stirling Highway, and Station Street and Railway Street.<\/li>\n<li><strong>Highgate spa: <\/strong>Both free and metered parking is available on Pier Street.<\/li>\n<li><strong>Wembley spa: <\/strong>Free parking is situated on Nanson Street.<\/li>\n<li><strong>Westin spa: <\/strong>Valet parking is available (charges apply) and metered parking is available next door to the hotel.<\/li>\n<li><strong>Injidup spa: <\/strong>Free parking is available on the right-hand side of the car park.<\/li>\n<\/ul>\n<h3>Pregnancy<\/h3>\n<p>It is important that you advise us your pregnancy when you make your booking.  Some spa treatments may require you to be in your second trimester while others may not be suitable for pregnant guests.<\/p>\n<h3>Health Conditions<\/h3>\n<p>Please inform us at the time of booking of any medical or health conditions, allergies or injury, or if you are undergoing radiation or chemotherapy. We recommend that you discuss with your doctor which treatments are safe for you.<\/p>\n<h3>Group Bookings<\/h3>\n<p>We are more than happy host groups for birthday celebrations, hen parties and corporate groups. For groups of four or more we do require a 50% non-refundable deposit at the time of booking.<\/p>\n<h3>Discounts<\/h3>\n<p>Please be aware that discount vouchers cannot be used in conjunction with gift voucher redemptions. Discounts cannot be applied to our Spa Journey packages. No discounts can be applied to any services\/treatments on Sundays and public holidays.<\/p>\n<h3>Minimum Age<\/h3>\n<p>All guests must be a minimum of 18 years of age to use the spa facilities and services. Guests aged from 10 years may attend if accompanied by an adult.<\/p>\n<h3>Privacy<\/h3>\n<p>All personal information shared with Bodhi will remain private and confidential.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>GENERAL BODHI SPA TERMS &amp; CONDITIONS Arrival Time Please arrive 15 minutes prior to your treatment start time to allow time for you to change and unwind. Arriving late will reduce the treatment time, to ensure the next guest is not delayed. We invite you to make full use of our lounge facilities before and&hellip;<\/p>\n","protected":false},"author":3,"featured_media":46626,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/pages\/45980"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/comments?post=45980"}],"version-history":[{"count":13,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/pages\/45980\/revisions"}],"predecessor-version":[{"id":90889,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/pages\/45980\/revisions\/90889"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/46626"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=45980"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}