{"id":46119,"date":"2021-02-25T06:15:29","date_gmt":"2021-02-25T06:15:29","guid":{"rendered":"https:\/\/wiry-tin.flywheelsites.com\/product\/import-placeholder-for-3316\/"},"modified":"2021-04-12T06:35:01","modified_gmt":"2021-04-12T06:35:01","slug":"samadara-ultimate-age-defying-elixir-20ml","status":"publish","type":"product","link":"https:\/\/www.bodhispa.com\/product\/samadara-ultimate-age-defying-elixir-20ml\/","title":{"rendered":"Samadara Ultimate Age Defying Elixir (20ml)"},"content":{"rendered":"<p>Sodashi’s most intensive skin transforming treatment to balance the skin and correct visible signs of ageing. A unique alchemy of the purest botanical ingredients enlivened with rose quartz crystals, it boosts the skin’s natural renewal cycle to significantly diminish lines, reduce pigmentation and refine pores. Skin looks clear, translucent, more lifted and firmed.<\/p>\n<p>In an era of instant gratification, the Samadara Ultimate Age-Defying Elixir is a speedy worker. This Elixir intervenes at a cellular level to support and deeply nourish the skin. From the first application, expect your complexion to be visibly refined and skin’s resilience dramatically improved.<\/p>\n<p>This precious Elixir is a synergy of fifteen exceptionally nourishing and precious plant oils and extracts enlivened with the vibrational qualities of rose quartz crystals. Combined, these ingredients deliver an effect that is far, far greater than the sum of the individual parts.When you apply the Elixir, not only does your skin get that elusive glow, you also get a feeling of bien-être as the French say, a beautiful sense of wellbeing.<\/p>\n<p>Each bottle comes complete with two rose quartz crystals to enliven the pure plant formula and give the Elixir a stabilising energy. From the first application, expect your complexion to be visibly refined, softer and firmer and skin’s resilience dramatically improved. By using the Ayurvedic healing massage technique to apply the elixir.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A unique alchemy of the purest botanical ingredients enlivened with rose quartz crystals, it boosts the skin’s natural renewal cycle to significantly diminish lines, reduce pigmentation and refine pores.<\/p>\n","protected":false},"featured_media":46167,"template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product\/46119"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/46167"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=46119"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}