{"id":80861,"date":"2021-12-01T14:26:31","date_gmt":"2021-12-01T06:26:31","guid":{"rendered":"https:\/\/www.bodhispa.com\/?post_type=product&#038;p=80861"},"modified":"2022-08-26T12:49:13","modified_gmt":"2022-08-26T04:49:13","slug":"supernatural-72-hour-creme","status":"publish","type":"product","link":"https:\/\/www.bodhispa.com\/product\/supernatural-72-hour-creme\/","title":{"rendered":"Supernatural Face Creme Riche (50ml)"},"content":{"rendered":"<p>The Emma Lewisham Supernatural Crème uses 72 hour moisture lock technology to deeply hydrate the skin, instantly delivering a luminous glow alongside phenomenal age-defying results. A powerful combination of naturally active ingredients, this scientifically proven* formulation sets a new benchmark in skincare.<\/p>\n<p>Smoothing Collagen Peptides help by lifting and plumping, reducing the appearance of fine lines and wrinkles, and visibly improving skin texture and suppleness. Simultaneously, our hero hydrating innovation, Saccharide Isomerate helps replenish skin moisture to plump the appearance of skin and plumping your skin from the inside out.<\/p>\n<p>A tall drink of water for a dehydrated complexion, expect your skin to feel deeply hydrated, look visibly lifted, and radiate a dewy, youthful glow. This luxurious, velvety formulation is beautiful to wear and delivers truly transformative results from the very first use.<\/p>\n<p>*<em>Independent In-Vitro Scientific Testing into the effects on the production of type 1 collagen (2020)135<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This advanced moisturising crème is packed with the latest high performing ingredients and scientifically proven to regenerate collagen at a cellular level*, lift the look of the skin and enhance glow and suppleness.<\/p>\n<p>* Independent in-vitro test (2020) investigating the production of Type 1 collagen by human skin fibroblasts<\/p>\n","protected":false},"featured_media":92235,"template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product\/80861"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/92235"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=80861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}