{"id":92071,"date":"2022-08-23T10:52:53","date_gmt":"2022-08-23T02:52:53","guid":{"rendered":"https:\/\/www.bodhispa.com\/?post_type=product&#038;p=92071"},"modified":"2022-08-26T12:57:03","modified_gmt":"2022-08-26T04:57:03","slug":"supernatural-sleeping-mask","status":"publish","type":"product","link":"https:\/\/www.bodhispa.com\/product\/supernatural-sleeping-mask\/","title":{"rendered":"Supernatural Sleeping Mask (50ml)"},"content":{"rendered":"<p>Beauty sleep in a bottle &#8211; Emma Lewisham&#8217;s pioneering Sleeping Mask is a highly concentrated, at-home skin treatment for dramatically elevated results in skin regeneration.<\/p>\n<p>Specialised Gardenia Jasminoides Extract works by enhancing the skin&#8217;s natural night-time restoration by boosting the activation of our skin&#8217;s melatonin receptors, which trigger night-time cellular repair, renewal and regeneration processes. While you sleep, 22 active ingredients work to powerfully rejuvenate the skin &#8211; regenerating collagen, stimulating cell turnover, removing toxins and repairing the skin barrier for visibly brighter, plumper, firmer and deeply nourished skin by morning.<\/p>\n<p>A unique combination of lipopeptides, antioxidants, ceramides and specialised energy molecules work to restore the skin&#8217;s structure. Their dual action effect helps increase collagen and elastin production while simultaneously protecting its degradation, for plump, supple and firm skin. Emma Lewisham&#8217;s cutting-edge brightening complex gently dissolves the ‘glue’ that binds dead skin cells and their triple action hydrating complex delivers a dramatic increase in skin moisture for up to 3 days. Designed to work synergistically with the skin, this skin-elevating formula taps into and amplifies our natural night-time skin cycle to unlock unparalleled results.<\/p>\n<p>Hero Ingredients:<\/p>\n<p>• Optimised Nocturnal Activity: Next generation innovation that restores skin’s own beneficial overnight activity system. Gardenia Jasminoides extracts enhance the melatonin-mediated cascade of beneficial skin activity.<\/p>\n<p>• Rebuilding and Strengthening Complex: A next generation triple-action complex that rebuilds the skin’s structural matrix for strong and resilient skin. Peptides combined with cellular energy enhancers, Ribose and CoQ10, enhance our fibroblast’s synthesis of collagen, decreasing the appearance of wrinkles.<\/p>\n<p>• Powerful Hydration and Radiance Complex: Next generation hydrating hero Saccharide Isomerate increases the skin’s own production of hyaluronic acid, while an advanced hyaluronic acid delivers moisture deeply into the skin. Specialised ceramides enhance the skin barrier to protect and lock in the profound hydration, which is proven to persist for up to 72 hours to profoundly lift and smooth this area of delicate skin. Gentle AHA\/BHA’s reveal fresh skin, delivering glowing skin by morning.<\/p>\n<p>Emma Lewisham&#8217;s Formulating Philosophy Emma Lewisham&#8217;s formulations focus on the physiology of the skin, determining how multiple ingredient combinations can work in synergy with each other to deliver superior results. Developed by scientists and physiologists with over 100 years combined experience, our formulas are engineered with up to 25 meticulously chosen ingredients that are individually efficacious, but in combination work to amplify each other to provide next generation results.<\/p>\n<p>The most powerful way to interact with the skin is naturally, therefore Emma Lewisham only use natural ingredients, harnessing both bio-identical ingredients found within the skin as well as the specialised, scientifically proven natural plant extracts. These bio-active ingredients work in harmony with the skin to trigger powerful cellular responses that deliver unparalleled results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Beauty sleep in a bottle &#8211; Emma Lewisham&#8217;s pioneering Sleeping Mask is a highly concentrated, at-home skin treatment for dramatically elevated results in skin regeneration.<\/p>\n<p>Specialised Gardenia Jasminoides Extract works by enhancing the skin&#8217;s natural night-time restoration by boosting the activation of our skin&#8217;s melatonin receptors, which trigger night-time cellular repair, renewal and regeneration processes. While you sleep, 22 active ingredients work to powerfully rejuvenate the skin &#8211; regenerating collagen, stimulating cell turnover, removing toxins and repairing the skin barrier for visibly brighter, plumper, firmer and deeply nourished skin by morning.<\/p>\n<p>Designed to work synergistically with the skin, this skin-elevating formula taps into and amplifies our natural night-time skin cycle to unlock unparalleled results.<\/p>\n","protected":false},"featured_media":92245,"template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product\/92071"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/92245"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=92071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}