{"id":92074,"date":"2022-08-23T10:49:57","date_gmt":"2022-08-23T02:49:57","guid":{"rendered":"https:\/\/www.bodhispa.com\/?post_type=product&#038;p=92074"},"modified":"2022-08-26T12:43:28","modified_gmt":"2022-08-26T04:43:28","slug":"skin-reset-eye-creme-refill","status":"publish","type":"product","link":"https:\/\/www.bodhispa.com\/product\/skin-reset-eye-creme-refill\/","title":{"rendered":"Skin Reset Eye Crème Refill (15ml)"},"content":{"rendered":"<p>Thank you for choosing to purchase a refill pod and keep your packaging in use! Please remember not to throw out your empty pod &#8211; simply pop it out and send it back to us (using our free returns label) to be sterilised and refilled through our circularity initiative &#8211; Beauty Circle.<\/p>\n<p>By purchasing a refill you are reducing your impact by:<\/p>\n<ul>\n<li>Up to 63% less CO2 emissions*<\/li>\n<li>60% less energy**<\/li>\n<li>45% less water**<\/li>\n<li>Minimising the 114 billion units of beauty packaging discarded each year***<\/li>\n<\/ul>\n<p>We think endlessly producing new things instead of using what we have makes zero sense. Why would we extract new things from the ground, use more energy, more water and produce more carbon, when we can use the valuable materials we already have. It also makes zero sense to recycle* things after a single use (using more energy and omitting more carbon) when they are strong enough to last many uses! Sounds silly doesn’t it? We agree. It’s time to go circular. Let’s keep our precious resources in circulation and lower our impact together.<\/p>\n<p>*Toitū Climate Positive Certification data 2021<\/p>\n<p>**LCA<\/p>\n<p>***Zero Waste<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This powerful next generation eye crème harnesses the latest in skincare technology. A deeply conditioning crème, it helps to dramatically improve the appearance of dark circles, puffiness, surface discolouration and uneven skin tone.<\/p>\n<p>Formulated with 18 high performing ingredients and innovative, industry leading delivery systems it increases the bioavailability of ingredients to lift and firm the eye area. With daily use, fine lines and wrinkles are significantly softened to reveal a healthier looking, smoother and more luminous under eye area.<\/p>\n<p>Emma Lewisham&#8217;s unique liposomal delivery system increases the bioavailability of powerful antioxidant CoQ10, boosting cellular energy production and reinvigorating tired, lacklustre skin. Hydration heroes Saccharide Isomerate and Hyaluronic Acid lock in deep 72-hour moisture and reduce transepidermal water loss for a soft, supple and brighter under eye area.<\/p>\n","protected":false},"featured_media":92230,"template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product\/92074"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/92230"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=92074"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}