{"id":92122,"date":"2022-08-23T11:55:45","date_gmt":"2022-08-23T03:55:45","guid":{"rendered":"https:\/\/www.bodhispa.com\/?post_type=product&#038;p=92122"},"modified":"2022-08-26T12:25:48","modified_gmt":"2022-08-26T04:25:48","slug":"illuminating-face-body-oil-refill-115ml","status":"publish","type":"product","link":"https:\/\/www.bodhispa.com\/product\/illuminating-face-body-oil-refill-115ml\/","title":{"rendered":"Illuminating Face &#038; Body Oil Refill (115ml)"},"content":{"rendered":"<p>Thank you for choosing to purchase a refill pod and keep your packaging in use! Please note our Supernatural 72-Hour Crème has changed packaging in June 2021 to a refillable plastic jar with a refill pod. If you still have an older glass jar, you’ll need to purchase the new jar initially, then you’ll be able to purchase refill pods on-going. You can still return your empty pod and original jar to us for recycling &#8211; simply send them back to us (using our free returns label) to be sterilised and refilled through our circularity initiative &#8211; Beauty Circle.<\/p>\n<p>By purchasing a refill you are reducing your impact by:<\/p>\n<ul>\n<li>Up to 74% less CO2 emissions*<\/li>\n<li>60% less energy**<\/li>\n<li>45% less water**<\/li>\n<li>Minimising the 114 billion units of beauty packaging discarded each year***<\/li>\n<\/ul>\n<p>We think endlessly producing new things instead of using what we have makes zero sense. Why would we extract new things from the ground, use more energy, more water and produce more carbon, when we can use the valuable materials we already have. It also makes zero sense to recycle* things after a single use (using more energy and omitting more carbon) when they are strong enough to last many uses! Sounds silly doesn’t it? We agree. It’s time to go circular. Let’s keep our precious resources in circulation and lower our impact together.<\/p>\n<p>*Toitū Climate Positive Certification data 2021<\/p>\n<p>**LCA<\/p>\n<p>***Zero Waste<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This luxurious, nutrient dense bronzing oil deeply hydrates and nourishes the skin while delivering an instantly sun-kissed glow from head to toe.<\/p>\n<p>Pioneering the use of an oil-soluble, patented hyaluronic acid innovation, this works in synergy with a rich botanical complex to replenish moisture, improving the appearance of fine lines and wrinkles while simultaneously balancing the skin surface lipid profile to improve the appearance of skin elasticity and firmness.<\/p>\n<p>This fast-absorbing oil contains ultra-fine minerals which glisten on the skin, acting as a flattering skin tone corrector and softly bronzing the skin for a healthy and radiant all-over glow.<\/p>\n","protected":false},"featured_media":92213,"template":"","meta":{"inline_featured_image":false},"acf":[],"_links":{"self":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product\/92122"}],"collection":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media\/92213"}],"wp:attachment":[{"href":"https:\/\/www.bodhispa.com\/wp-json\/wp\/v2\/media?parent=92122"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}